Autodesk.Revit.DB.DirectShapeOptions.PresentationType
Identifies the DirectShape's GRep presentation type, used to determine its drawing order.
Before exposing to public_api: note that non-default presentation types may not make sense
for DirectShapes which consist of solids.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.AllowsTagAlongCurve
Identifies whether the generic category tag for this DirectShape can be placed
by letting its leader slide along the DirectShape's curves,
as opposed to attach to the GRep's BBox center (default behavior).
Currently, tag along curve is only implemented for plan views.
Before exposing to public_api: note that enabling tag along curve behavior may not make sense
for DirectShapes which consist of solids.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.AllowsLock
Identifies whether the DirectShape can be locked.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.AllowsCopy
Identifies whether the DirectShape can be copied.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.AllowsMove
Identifies whether the DirectShape is allowed to be moved or rotated.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.AllowsChangeTypeId
Identifies whether the DirectShape allows for changes to its type id.
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions.ReferencingOption
Whether or not the geometry stored in a DirectShape object may be referenced.
Remarks:
If the geometry is not referenceable, it may not be used for dimensioning, snapping, alignment, or face-hosting.
The element may still be selected by the user for operations which do not reference individual geometry objects.
The default value is Referenceable.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShapeOptions
This class is used to control behavior of a DirectShape object.
Remarks:
Use Enable/Disable functions to change the default behavior.
Use DirectShape.SetOptions to modify that object's behavior.
Since:
2016